<?php

namespace Database\Seeders;

use Domain\Shared\Models\Content;
use Illuminate\Database\Eloquent\Factories\Sequence;
use Illuminate\Database\Seeder;

class ContentsSeeders extends Seeder
{
    public function run(): void
    {
        Content::factory()->count(2)
            ->state(new Sequence(
                ['for' => 'about_the_contest',
                    'text' => '<div><span style="">Конкурс цифрового искусства приглашает участников продемонстрировать художественный талант и оригинальное мировоззрение, а также заявить о себе, привнести в жизнь людей нечто новое и уникальное, примкнуть к продвинутым деятелям нового digital-движения.&nbsp;</span></div>




<p><span style="">Платформа нацелена на создание сообщества художников, расширение границ творчества, просвещение общественности о преимуществах блокчейн-технологии, поддержку молодых художников и развитие культуры доверия, внимания и соучастия.</span></p>




<p><span style="">Наш конкурс отличается от других подобных конкурсов тем, что мы ставим качество и оригинальность работ выше популярности или количества подписчиков в социальных сетях. Решения о визуальной и смысловой ценности произведений выносит опытная судейская команда, которая состоит из профессиональных экспертов в области цифрового искусства и NFT.&nbsp;</span></p>




<p><span style="">Конкурс предоставляет шанс каждому участнику добиться успеха в цифровую эпоху. Победа в конкурсе может стать серьезным толчком в развитии карьеры, обеспечить авторитет и легитимность среди профессионалов арт-рынка, многократно увеличить узнаваемость у широкой аудитории и обеспечить новые контакты для дальнейшего сотрудничества и получения роялти. Наконец, участие в конкурсе даст новые знания о том, как блокчейн технологии можно использовать для монетизации собственного цифрового искусства. <br /></span></p>


<p><span style="font-weight: bold;">Что нас объединяет?<br /></span></p>


<ul><li><span style="">художественная практика, как акт самопрезентации и самоидентификации в творческом комьюнити;&nbsp;</span></li><li><span style="">раскрепощение творческих способностей;&nbsp;</span></li><li><span style="">понимание безграничности красоты;&nbsp;</span></li><li><span style="">вера в силу и мощь воображения;&nbsp;</span></li><li><span style="">стремление выразить ответственность за будущее гармоничное мироустройство;</span></li><li><span style="">желание конструировать альтернативную реальность, наполненную любовью, согласием и уважением;&nbsp;</span></li><li><span style="">возможность заявить о своем творчестве широкой аудитории, не скованной границами музейных стен или территориальной принадлежностью.&nbsp;</span></li></ul>




<p><span style="">Мы создаем свою Вселенную, наполненную персонажами разных эпох, культурами разных стран. Наши индивидуальности различны, но все вместе мы хотим одного − жить в мире и гармонии и делать мир лучше, чем он есть.
Наше комьюнити объединяет всех, кто так или иначе служит делу зарождения, а также распространения красоты и творческой радости. Всех, кто создает искусство как «благодаря», так и «вопреки». Всех, кто трепетно относится к восстановлению гармонии в природе, обществе и мире в целом.</span></p>




<p><span style="font-style: italic; font-weight: bold;">Если ты один из нас, то быстрее регистрируйся и загружай свои цифровые художественные работы!</span><br /></p>'],
                ['for' => 'partners',
                    'text' => 'Русский музей - главный партнер нашего конкурса цифрового искусства. В рамках сотрудничества с музеем, победители конкурса получат возможность выставить свои работы в престижных залах музея. Это уникальная возможность для талантливых художников и цифровых художников представить свои произведения широкой аудитории и получить признание как виртуального, так и реального искусства. Спасибо Русскому музею за поддержку нашего конкурса и возможность раскрыть таланты новых художников.'],
            ))->create();
    }
}
