<?php

namespace Database\Seeders;

use Domain\News\Models\News;
use Illuminate\Database\Eloquent\Factories\Sequence;
use Illuminate\Database\Seeder;

class NewsSeeder extends Seeder
{
    public function run(): void
    {
        News::factory()
            ->count(4)
            ->state(new Sequence(
                [
                    'title' => 'Победители ArtBattle представят свои работы на выставке в Музее современного искусства',
                    'content' => 'Лучшие работы конкурса ArtBattle будут представлены на выставке в престижном музее, что даст участникам возможность показать свои творения широкой аудитории.'
                ],
                [
                    'title' => 'ArtBattle проводит мастер-класс по цифровой живописи',
                    'content' => 'В рамках конкурса ArtBattle будет проведен мастер-класс, на котором участники смогут освоить основы цифровой живописи и получить советы от профессионалов.'
                ],
                [
                    'title' => 'ArtBattle объявляет о сотрудничестве с технологическим стартапом для создания специального приложения для художников',
                    'content' => 'ArtBattle сообщает о партнерстве с технологическим стартапом для разработки специального приложения, которое поможет художникам создавать и демонстрировать свои работы  '
                ],
                [
                    'title' => 'ArtBattle представляет специальный онлайн-курс по цифровому искусству от известного художника',
                    'content' => 'ArtBattle запускает специальный онлайн-курс по цифровому искусству, который будет вести известный художник и эксперт в данной области.'
                ],
            ))->create();
    }
}
